conditional-auth-sample/src/main/resources/common/configs/create-twitter-idp.xml

<!--
  ~ Copyright (c) 2018, WSO2 Inc. (http://www.wso2.org) All Rights Reserved.
  ~
  ~ WSO2 Inc. licenses this file to you under the Apache License,
  ~ Version 2.0 (the "License"); you may not use this file except
  ~ in compliance with the License.
  ~ You may obtain a copy of the License at
  ~
  ~     http://www.apache.org/licenses/LICENSE-2.0
  ~
  ~ Unless required by applicable law or agreed to in writing,
  ~ software distributed under the License is distributed on an
  ~ "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
  ~ KIND, either express or implied.  See the License for the
  ~ specific language governing permissions and limitations
  ~ under the License.
  -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mgt="http://mgt.idp.carbon.wso2.org"
                  xmlns:xsd="http://model.common.application.identity.carbon.wso2.org/xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <mgt:addIdP>
            <!--Optional:-->
            <mgt:identityProvider>
                <!--Optional:-->
                <xsd:alias>https://localhost:9443/oauth2/token</xsd:alias>
                <!--Optional:-->
                <xsd:certificate/>
                <!--Optional:-->
                <xsd:claimConfig>
                    <!--Optional:-->
                    <xsd:alwaysSendMappedLocalSubjectId>false</xsd:alwaysSendMappedLocalSubjectId>
                    <!--Optional:-->
                    <xsd:localClaimDialect>true</xsd:localClaimDialect>
                    <!--Optional:-->
                    <xsd:roleClaimURI>http://wso2.org/claims/role</xsd:roleClaimURI>
                    <!--Optional:-->
                    <xsd:userClaimURI/>
                </xsd:claimConfig>
                <!--Optional:-->
                <xsd:defaultAuthenticatorConfig>
                    <!--Optional:-->
                    <xsd:displayName>TwitterAuthenticator</xsd:displayName>
                    <!--Optional:-->
                    <xsd:enabled>true</xsd:enabled>
                    <!--Optional:-->
                    <xsd:name>TwitterAuthenticator</xsd:name>
                    <!--Zero or more repetitions:-->
                    <xsd:properties>
                        <!--Optional:-->
                        <xsd:name>APIKey</xsd:name>
                        <!--Optional:-->
                        <xsd:value>${API_KEY}</xsd:value>
                    </xsd:properties>
                    <xsd:properties>
                        <!--Optional:-->
                        <xsd:name>APISecret</xsd:name>
                        <!--Optional:-->
                        <xsd:value>${API_SECRET}</xsd:value>
                    </xsd:properties>
                    <xsd:properties>
                        <!--Optional:-->
                        <xsd:name>callbackUrl</xsd:name>
                        <!--Optional:-->
                        <xsd:value>https://localhost:9443/commonauth</xsd:value>
                    </xsd:properties>
                </xsd:defaultAuthenticatorConfig>
                <!--Optional:-->
                <xsd:displayName>${DISPLAY_NAME}</xsd:displayName>
                <!--Optional:-->
                <xsd:enable>true</xsd:enable>
                <!--Zero or more repetitions:-->
                <xsd:federatedAuthenticatorConfigs>
                    <!--Optional:-->
                    <xsd:displayName>TwitterAuthenticator</xsd:displayName>
                    <!--Optional:-->
                    <xsd:enabled>true</xsd:enabled>
                    <!--Optional:-->
                    <xsd:name>TwitterAuthenticator</xsd:name>
                    <!--Zero or more repetitions:-->
                    <xsd:properties>
                        <!--Optional:-->
                        <xsd:name>APIKey</xsd:name>
                        <!--Optional:-->
                        <xsd:value>${API_KEY}</xsd:value>
                    </xsd:properties>
                    <xsd:properties>
                        <!--Optional:-->
                        <xsd:name>APISecret</xsd:name>
                        <!--Optional:-->
                        <xsd:value>${API_SECRET}</xsd:value>
                    </xsd:properties>
                    <xsd:properties>
                        <!--Optional:-->
                        <xsd:name>callbackUrl</xsd:name>
                        <!--Optional:-->
                        <xsd:value>https://localhost:9443/commonauth</xsd:value>
                    </xsd:properties>
                </xsd:federatedAuthenticatorConfigs>
                <!--Optional:-->
                <xsd:federationHub>false</xsd:federationHub>
                <!--Optional:-->
                <xsd:homeRealmId/>
                <!--Optional:-->
                <xsd:id>?</xsd:id>
                <!--Optional:-->
                <xsd:identityProviderDescription>Twitter Identity Provider</xsd:identityProviderDescription>
                <!--Optional:-->
                <xsd:identityProviderName>${IDP_NAME}</xsd:identityProviderName>
                <!--Optional:-->
                <xsd:permissionAndRoleConfig/>
                <!--Optional:-->
                <xsd:provisioningRole/>
            </mgt:identityProvider>
        </mgt:addIdP>
    </soapenv:Body>
</soapenv:Envelope>
